src/api-guides/travel/hotelservice2/sample-requests/general-walkthrough/cancel-rq.xml

<?xml version="1.0" encoding="UTF-8"?>

<!-- HTTP-headers start 

POST HTTP/1.1
accept: application/xml
accept-charset: utf-8
authorization: Basic xxxxxxxxxxxxxxxx
concur-correlationid: 56d927ab9ce69007f144904999e0fb4a
concur-traveleruuid:  xxxxxxxxxxxx
content-type: application/xml; charset="utf-8"
soapaction: cancel

    HTTP-headers end -->

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <authentication xmlns="http://www.concur.com/webservice/auth">
            <userid>xxxxxxxxxxxx</userid>
            <password>xxxxxxxxxxx</password>
        </authentication>
    </Header>
    <Body xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="7551F573-EEB1-42C0-9517-CE6357D68CA2" Version="3" PrimaryLangID="en" AltLangID="en">
            <POS>
                <Source ISOCurrency="USD">
                    <RequestorID Type="1" ID="requestor_id"></RequestorID>
                </Source>
            </POS>
            <UniqueID Type="14" ID="CS700058388-1"></UniqueID>
        </OTA_CancelRQ>
    </Body>
</Envelope>